madmoney99/OH-Sketches/boards.txt
apuleonardo.bootloader.tool=avrdude
apuleonardo.bootloader.tool.default=avrdude
apuleonardo.bootloader.low_fuses=0xff
apuleonardo.bootloader.high_fuses=0xd8
apuleonardo.bootloader.extended_fuses=0xcb
apuleonardo.bootloader.file=caterina/Caterina-Leonardo.hex
apuleonardo.bootloader.unlock_bits=0x3F
apuleonardo.bootloader.lock_bits=0x2F

apuleonardo.build.mcu=atmega32u4
apuleonardo.build.f_cpu=16000000L
apuleonardo.build.vid=0x2341
apuleonardo.build.pid=0x8059
apuleonardo.build.usb_product="APU Panel"
apuleonardo.build.board=AVR_LEONARDO
apuleonardo.build.core=arduino
apuleonardo.build.variant=leonardo
apuleonardo.build.extra_flags={build.usb_flags}

##############################################################

fuelleonardo.name=FUEL PANEL
fuelleonardo.vid.0=0x2341
fuelleonardo.pid.0=0x0036
fuelleonardo.vid.1=0x2341
fuelleonardo.pid.1=0x8036
fuelleonardo.vid.2=0x2A03
fuelleonardo.pid.2=0x0036
fuelleonardo.vid.3=0x2A03
fuelleonardo.pid.3=0x8036
fuelleonardo.upload_port.0.vid=0x2341
fuelleonardo.upload_port.0.pid=0x0036
fuelleonardo.upload_port.1.vid=0x2341
fuelleonardo.upload_port.1.pid=0x8036
fuelleonardo.upload_port.2.vid=0x2A03
fuelleonardo.upload_port.2.pid=0x0036
fuelleonardo.upload_port.3.vid=0x2A03
fuelleonardo.upload_port.3.pid=0x8036
fuelleonardo.upload_port.4.board=leonardo

fuelleonardo.upload.tool=avrdude
fuelleonardo.upload.tool.default=avrdude
fuelleonardo.upload.tool.network=arduino_ota
fuelleonardo.upload.protocol=avr109
fuelleonardo.upload.maximum_size=28672
fuelleonardo.upload.maximum_data_size=2560
fuelleonardo.upload.speed=57600
fuelleonardo.upload.disable_flushing=true
fuelleonardo.upload.use_1200bps_touch=true
fuelleonardo.upload.wait_for_upload_port=true

fuelleonardo.bootloader.tool=avrdude
fuelleonardo.bootloader.tool.default=avrdude
fuelleonardo.bootloader.low_fuses=0xff
fuelleonardo.bootloader.high_fuses=0xd8
fuelleonardo.bootloader.extended_fuses=0xcb
fuelleonardo.bootloader.file=caterina/Caterina-Leonardo.hex
fuelleonardo.bootloader.unlock_bits=0x3F
fuelleonardo.bootloader.lock_bits=0x2F

fuelleonardo.build.mcu=atmega32u4
fuelleonardo.build.f_cpu=16000000L
fuelleonardo.build.vid=0x2341
fuelleonardo.build.pid=0x8058
fuelleonardo.build.usb_product="FUEL PANEL"
fuelleonardo.build.board=AVR_LEONARDO
fuelleonardo.build.core=arduino
fuelleonardo.build.variant=leonardo
fuelleonardo.build.extra_flags={build.usb_flags}

##############################################################

snsrleonardo.name=SNSR PANEL
snsrleonardo.vid.0=0x2341
snsrleonardo.pid.0=0x0036
snsrleonardo.vid.1=0x2341
snsrleonardo.pid.1=0x8036
snsrleonardo.vid.2=0x2A03
snsrleonardo.pid.2=0x0036
snsrleonardo.vid.3=0x2A03
snsrleonardo.pid.3=0x8036
snsrleonardo.upload_port.0.vid=0x2341
snsrleonardo.upload_port.0.pid=0x0036
snsrleonardo.upload_port.1.vid=0x2341
snsrleonardo.upload_port.1.pid=0x8036
snsrleonardo.upload_port.2.vid=0x2A03
snsrleonardo.upload_port.2.pid=0x0036
snsrleonardo.upload_port.3.vid=0x2A03
snsrleonardo.upload_port.3.pid=0x8036
snsrleonardo.upload_port.4.board=leonardo

snsrleonardo.upload.tool=avrdude
snsrleonardo.upload.tool.default=avrdude
snsrleonardo.upload.tool.network=arduino_ota
snsrleonardo.upload.protocol=avr109
snsrleonardo.upload.maximum_size=28672
snsrleonardo.upload.maximum_data_size=2560
snsrleonardo.upload.speed=57600
snsrleonardo.upload.disable_flushing=true
snsrleonardo.upload.use_1200bps_touch=true
snsrleonardo.upload.wait_for_upload_port=true

snsrleonardo.bootloader.tool=avrdude
snsrleonardo.bootloader.tool.default=avrdude
snsrleonardo.bootloader.low_fuses=0xff
snsrleonardo.bootloader.high_fuses=0xd8
snsrleonardo.bootloader.extended_fuses=0xcb
snsrleonardo.bootloader.file=caterina/Caterina-Leonardo.hex
snsrleonardo.bootloader.unlock_bits=0x3F
snsrleonardo.bootloader.lock_bits=0x2F

snsrleonardo.build.mcu=atmega32u4
snsrleonardo.build.f_cpu=16000000L
snsrleonardo.build.vid=0x2341
snsrleonardo.build.pid=0x8057
snsrleonardo.build.usb_product="SNSR PANEL"
snsrleonardo.build.board=AVR_LEONARDO
snsrleonardo.build.core=arduino
snsrleonardo.build.variant=leonardo
snsrleonardo.build.extra_flags={build.usb_flags}

##############################################################

rhauxleonardo.name=RH AUX PANEL
rhauxleonardo.vid.0=0x2341
rhauxleonardo.pid.0=0x0036
rhauxleonardo.vid.1=0x2341
rhauxleonardo.pid.1=0x8036
rhauxleonardo.vid.2=0x2A03
rhauxleonardo.pid.2=0x0036
rhauxleonardo.vid.3=0x2A03
rhauxleonardo.pid.3=0x8036
rhauxleonardo.upload_port.0.vid=0x2341
rhauxleonardo.upload_port.0.pid=0x0036
rhauxleonardo.upload_port.1.vid=0x2341
rhauxleonardo.upload_port.1.pid=0x8036
rhauxleonardo.upload_port.2.vid=0x2A03
rhauxleonardo.upload_port.2.pid=0x0036
rhauxleonardo.upload_port.3.vid=0x2A03
rhauxleonardo.upload_port.3.pid=0x8036
rhauxleonardo.upload_port.4.board=leonardo

rhauxleonardo.upload.tool=avrdude
rhauxleonardo.upload.tool.default=avrdude
rhauxleonardo.upload.tool.network=arduino_ota
rhauxleonardo.upload.protocol=avr109
rhauxleonardo.upload.maximum_size=28672
rhauxleonardo.upload.maximum_data_size=2560
rhauxleonardo.upload.speed=57600
rhauxleonardo.upload.disable_flushing=true
rhauxleonardo.upload.use_1200bps_touch=true
rhauxleonardo.upload.wait_for_upload_port=true

rhauxleonardo.bootloader.tool=avrdude
rhauxleonardo.bootloader.tool.default=avrdude
rhauxleonardo.bootloader.low_fuses=0xff
rhauxleonardo.bootloader.high_fuses=0xd8
rhauxleonardo.bootloader.extended_fuses=0xcb
rhauxleonardo.bootloader.file=caterina/Caterina-Leonardo.hex
rhauxleonardo.bootloader.unlock_bits=0x3F
rhauxleonardo.bootloader.lock_bits=0x2F

rhauxleonardo.build.mcu=atmega32u4
rhauxleonardo.build.f_cpu=16000000L
rhauxleonardo.build.vid=0x2341
rhauxleonardo.build.pid=0x8049
rhauxleonardo.build.usb_product="RH AUX PANEL"
rhauxleonardo.build.board=AVR_LEONARDO
rhauxleonardo.build.core=arduino
rhauxleonardo.build.variant=leonardo
rhauxleonardo.build.extra_flags={build.usb_flags}

##############################################################

elecleonardo.name=ELEC PANEL
elecleonardo.vid.0=0x2341
elecleonardo.pid.0=0x0036
elecleonardo.vid.1=0x2341
elecleonardo.pid.1=0x8036
elecleonardo.vid.2=0x2A03
elecleonardo.pid.2=0x0036
elecleonardo.vid.3=0x2A03
elecleonardo.pid.3=0x8036
elecleonardo.upload_port.0.vid=0x2341
elecleonardo.upload_port.0.pid=0x0036
elecleonardo.upload_port.1.vid=0x2341
elecleonardo.upload_port.1.pid=0x8036
elecleonardo.upload_port.2.vid=0x2A03
elecleonardo.upload_port.2.pid=0x0036
elecleonardo.upload_port.3.vid=0x2A03
elecleonardo.upload_port.3.pid=0x8036
elecleonardo.upload_port.4.board=leonardo

elecleonardo.upload.tool=avrdude
elecleonardo.upload.tool.default=avrdude
elecleonardo.upload.tool.network=arduino_ota
elecleonardo.upload.protocol=avr109
elecleonardo.upload.maximum_size=28672
elecleonardo.upload.maximum_data_size=2560
elecleonardo.upload.speed=57600
elecleonardo.upload.disable_flushing=true
elecleonardo.upload.use_1200bps_touch=true
elecleonardo.upload.wait_for_upload_port=true

elecleonardo.bootloader.tool=avrdude
elecleonardo.bootloader.tool.default=avrdude
elecleonardo.bootloader.low_fuses=0xff
elecleonardo.bootloader.high_fuses=0xd8
elecleonardo.bootloader.extended_fuses=0xcb
elecleonardo.bootloader.file=caterina/Caterina-Leonardo.hex
elecleonardo.bootloader.unlock_bits=0x3F
elecleonardo.bootloader.lock_bits=0x2F

elecleonardo.build.mcu=atmega32u4
elecleonardo.build.f_cpu=16000000L
elecleonardo.build.vid=0x2341
elecleonardo.build.pid=0x8048
elecleonardo.build.usb_product="ELEC PANEL"
elecleonardo.build.board=AVR_LEONARDO
elecleonardo.build.core=arduino
elecleonardo.build.variant=leonardo
elecleonardo.build.extra_flags={build.usb_flags}

