madmoney99/OH-Sketches/boards.txt
##############################################################

FCSleonardo.name=FCS PANEL
FCSleonardo.vid.0=0x2341
FCSleonardo.pid.0=0x0036
FCSleonardo.vid.1=0x2341
FCSleonardo.pid.1=0x8036
FCSleonardo.vid.2=0x2A03
FCSleonardo.pid.2=0x0036
FCSleonardo.vid.3=0x2A03
FCSleonardo.pid.3=0x8036
FCSleonardo.upload_port.0.vid=0x2341
FCSleonardo.upload_port.0.pid=0x0036
FCSleonardo.upload_port.1.vid=0x2341
FCSleonardo.upload_port.1.pid=0x8036
FCSleonardo.upload_port.2.vid=0x2A03
FCSleonardo.upload_port.2.pid=0x0036
FCSleonardo.upload_port.3.vid=0x2A03
FCSleonardo.upload_port.3.pid=0x8036
FCSleonardo.upload_port.4.board=leonardo

FCSleonardo.upload.tool=avrdude
FCSleonardo.upload.tool.default=avrdude
FCSleonardo.upload.tool.network=arduino_ota
FCSleonardo.upload.protocol=avr109
FCSleonardo.upload.maximum_size=28672
FCSleonardo.upload.maximum_data_size=2560
FCSleonardo.upload.speed=57600
FCSleonardo.upload.disable_flushing=true
FCSleonardo.upload.use_1200bps_touch=true
FCSleonardo.upload.wait_for_upload_port=true

FCSleonardo.bootloader.tool=avrdude
FCSleonardo.bootloader.tool.default=avrdude
FCSleonardo.bootloader.low_fuses=0xff
FCSleonardo.bootloader.high_fuses=0xd8
FCSleonardo.bootloader.extended_fuses=0xcb
FCSleonardo.bootloader.file=caterina/Caterina-Leonardo.hex
FCSleonardo.bootloader.unlock_bits=0x3F
FCSleonardo.bootloader.lock_bits=0x2F

FCSleonardo.build.mcu=atmega32u4
FCSleonardo.build.f_cpu=16000000L
FCSleonardo.build.vid=0x2341
FCSleonardo.build.pid=0x8046
FCSleonardo.build.usb_product="FCS PANEL"
FCSleonardo.build.board=AVR_LEONARDO
FCSleonardo.build.core=arduino
FCSleonardo.build.variant=leonardo
FCSleonardo.build.extra_flags={build.usb_flags}

##############################################################

OBOGSleonardo.name=OBOGS PANEL
OBOGSleonardo.vid.0=0x2341
OBOGSleonardo.pid.0=0x0036
OBOGSleonardo.vid.1=0x2341
OBOGSleonardo.pid.1=0x8036
OBOGSleonardo.vid.2=0x2A03
OBOGSleonardo.pid.2=0x0036
OBOGSleonardo.vid.3=0x2A03
OBOGSleonardo.pid.3=0x8036
OBOGSleonardo.upload_port.0.vid=0x2341
OBOGSleonardo.upload_port.0.pid=0x0036
OBOGSleonardo.upload_port.1.vid=0x2341
OBOGSleonardo.upload_port.1.pid=0x8036
OBOGSleonardo.upload_port.2.vid=0x2A03
OBOGSleonardo.upload_port.2.pid=0x0036
OBOGSleonardo.upload_port.3.vid=0x2A03
OBOGSleonardo.upload_port.3.pid=0x8036
OBOGSleonardo.upload_port.4.board=leonardo

OBOGSleonardo.upload.tool=avrdude
OBOGSleonardo.upload.tool.default=avrdude
OBOGSleonardo.upload.tool.network=arduino_ota
OBOGSleonardo.upload.protocol=avr109
OBOGSleonardo.upload.maximum_size=28672
OBOGSleonardo.upload.maximum_data_size=2560
OBOGSleonardo.upload.speed=57600
OBOGSleonardo.upload.disable_flushing=true
OBOGSleonardo.upload.use_1200bps_touch=true
OBOGSleonardo.upload.wait_for_upload_port=true

OBOGSleonardo.bootloader.tool=avrdude
OBOGSleonardo.bootloader.tool.default=avrdude
OBOGSleonardo.bootloader.low_fuses=0xff
OBOGSleonardo.bootloader.high_fuses=0xd8
OBOGSleonardo.bootloader.extended_fuses=0xcb
OBOGSleonardo.bootloader.file=caterina/Caterina-Leonardo.hex
OBOGSleonardo.bootloader.unlock_bits=0x3F
OBOGSleonardo.bootloader.lock_bits=0x2F

OBOGSleonardo.build.mcu=atmega32u4
OBOGSleonardo.build.f_cpu=16000000L
OBOGSleonardo.build.vid=0x2341
OBOGSleonardo.build.pid=0x8047
OBOGSleonardo.build.usb_product="OBOGS PANEL"
OBOGSleonardo.build.board=AVR_LEONARDO
OBOGSleonardo.build.core=arduino
OBOGSleonardo.build.variant=leonardo
OBOGSleonardo.build.extra_flags={build.usb_flags}

##############################################################

ECMleonardo.name=ECM PANEL
ECMleonardo.vid.0=0x2341
ECMleonardo.pid.0=0x0036
ECMleonardo.vid.1=0x2341
ECMleonardo.pid.1=0x8036
ECMleonardo.vid.2=0x2A03
ECMleonardo.pid.2=0x0036
ECMleonardo.vid.3=0x2A03
ECMleonardo.pid.3=0x8036
ECMleonardo.upload_port.0.vid=0x2341
ECMleonardo.upload_port.0.pid=0x0036
ECMleonardo.upload_port.1.vid=0x2341
ECMleonardo.upload_port.1.pid=0x8036
ECMleonardo.upload_port.2.vid=0x2A03
ECMleonardo.upload_port.2.pid=0x0036
ECMleonardo.upload_port.3.vid=0x2A03
ECMleonardo.upload_port.3.pid=0x8036
ECMleonardo.upload_port.4.board=leonardo

ECMleonardo.upload.tool=avrdude
ECMleonardo.upload.tool.default=avrdude
ECMleonardo.upload.tool.network=arduino_ota
ECMleonardo.upload.protocol=avr109
ECMleonardo.upload.maximum_size=28672
ECMleonardo.upload.maximum_data_size=2560
ECMleonardo.upload.speed=57600
ECMleonardo.upload.disable_flushing=true
ECMleonardo.upload.use_1200bps_touch=true
ECMleonardo.upload.wait_for_upload_port=true

ECMleonardo.bootloader.tool=avrdude
ECMleonardo.bootloader.tool.default=avrdude
ECMleonardo.bootloader.low_fuses=0xff
ECMleonardo.bootloader.high_fuses=0xd8
ECMleonardo.bootloader.extended_fuses=0xcb
ECMleonardo.bootloader.file=caterina/Caterina-Leonardo.hex
ECMleonardo.bootloader.unlock_bits=0x3F
ECMleonardo.bootloader.lock_bits=0x2F

ECMleonardo.build.mcu=atmega32u4
ECMleonardo.build.f_cpu=16000000L
ECMleonardo.build.vid=0x2341
ECMleonardo.build.pid=0x8060
ECMleonardo.build.usb_product="ECM PANEL"
ECMleonardo.build.board=AVR_LEONARDO
ECMleonardo.build.core=arduino
ECMleonardo.build.variant=leonardo
ECMleonardo.build.extra_flags={build.usb_flags}

##############################################################

LDDIleonardo.name=LEFTDDI
LDDIleonardo.vid.0=0x2341
LDDIleonardo.pid.0=0x0036
LDDIleonardo.vid.1=0x2341
LDDIleonardo.pid.1=0x8036
LDDIleonardo.vid.2=0x2A03
LDDIleonardo.pid.2=0x0036
LDDIleonardo.vid.3=0x2A03
LDDIleonardo.pid.3=0x8036
LDDIleonardo.upload_port.0.vid=0x2341
LDDIleonardo.upload_port.0.pid=0x0036
LDDIleonardo.upload_port.1.vid=0x2341
LDDIleonardo.upload_port.1.pid=0x8036
LDDIleonardo.upload_port.2.vid=0x2A03
LDDIleonardo.upload_port.2.pid=0x0036
LDDIleonardo.upload_port.3.vid=0x2A03
LDDIleonardo.upload_port.3.pid=0x8036
LDDIleonardo.upload_port.4.board=leonardo

LDDIleonardo.upload.tool=avrdude
LDDIleonardo.upload.tool.default=avrdude
LDDIleonardo.upload.tool.network=arduino_ota
LDDIleonardo.upload.protocol=avr109
LDDIleonardo.upload.maximum_size=28672
LDDIleonardo.upload.maximum_data_size=2560
LDDIleonardo.upload.speed=57600
LDDIleonardo.upload.disable_flushing=true
LDDIleonardo.upload.use_1200bps_touch=true
LDDIleonardo.upload.wait_for_upload_port=true

LDDIleonardo.bootloader.tool=avrdude
LDDIleonardo.bootloader.tool.default=avrdude
LDDIleonardo.bootloader.low_fuses=0xff
LDDIleonardo.bootloader.high_fuses=0xd8
LDDIleonardo.bootloader.extended_fuses=0xcb
LDDIleonardo.bootloader.file=caterina/Caterina-Leonardo.hex
LDDIleonardo.bootloader.unlock_bits=0x3F
LDDIleonardo.bootloader.lock_bits=0x2F

LDDIleonardo.build.mcu=atmega32u4
LDDIleonardo.build.f_cpu=16000000L
LDDIleonardo.build.vid=0x2341
LDDIleonardo.build.pid=0x8069
LDDIleonardo.build.usb_product="LEFTDDI"
LDDIleonardo.build.board=AVR_LEONARDO
LDDIleonardo.build.core=arduino
LDDIleonardo.build.variant=leonardo
LDDIleonardo.build.extra_flags={build.usb_flags}

