madmoney99/OH-Sketches/boards.txt
##############################################################

marmleonardo.name=Master Arm
marmleonardo.vid.0=0x2341
marmleonardo.pid.0=0x0036
marmleonardo.vid.1=0x2341
marmleonardo.pid.1=0x8036
marmleonardo.vid.2=0x2A03
marmleonardo.pid.2=0x0036
marmleonardo.vid.3=0x2A03
marmleonardo.pid.3=0x8036
marmleonardo.upload_port.0.vid=0x2341
marmleonardo.upload_port.0.pid=0x0036
marmleonardo.upload_port.1.vid=0x2341
marmleonardo.upload_port.1.pid=0x8036
marmleonardo.upload_port.2.vid=0x2A03
marmleonardo.upload_port.2.pid=0x0036
marmleonardo.upload_port.3.vid=0x2A03
marmleonardo.upload_port.3.pid=0x8036
marmleonardo.upload_port.4.board=leonardo

marmleonardo.upload.tool=avrdude
marmleonardo.upload.tool.default=avrdude
marmleonardo.upload.tool.network=arduino_ota
marmleonardo.upload.protocol=avr109
marmleonardo.upload.maximum_size=28672
marmleonardo.upload.maximum_data_size=2560
marmleonardo.upload.speed=57600
marmleonardo.upload.disable_flushing=true
marmleonardo.upload.use_1200bps_touch=true
marmleonardo.upload.wait_for_upload_port=true

marmleonardo.bootloader.tool=avrdude
marmleonardo.bootloader.tool.default=avrdude
marmleonardo.bootloader.low_fuses=0xff
marmleonardo.bootloader.high_fuses=0xd8
marmleonardo.bootloader.extended_fuses=0xcb
marmleonardo.bootloader.file=caterina/Caterina-Leonardo.hex
marmleonardo.bootloader.unlock_bits=0x3F
marmleonardo.bootloader.lock_bits=0x2F

marmleonardo.build.mcu=atmega32u4
marmleonardo.build.f_cpu=16000000L
marmleonardo.build.vid=0x2341
marmleonardo.build.pid=0x8061
marmleonardo.build.usb_product="MasterArm"
marmleonardo.build.board=AVR_LEONARDO
marmleonardo.build.core=arduino
marmleonardo.build.variant=leonardo
marmleonardo.build.extra_flags={build.usb_flags}

##############################################################

hudleonardo.name=HUD
hudleonardo.vid.0=0x2341
hudleonardo.pid.0=0x0036
hudleonardo.vid.1=0x2341
hudleonardo.pid.1=0x8036
hudleonardo.vid.2=0x2A03
hudleonardo.pid.2=0x0036
hudleonardo.vid.3=0x2A03
hudleonardo.pid.3=0x8036
hudleonardo.upload_port.0.vid=0x2341
hudleonardo.upload_port.0.pid=0x0036
hudleonardo.upload_port.1.vid=0x2341
hudleonardo.upload_port.1.pid=0x8036
hudleonardo.upload_port.2.vid=0x2A03
hudleonardo.upload_port.2.pid=0x0036
hudleonardo.upload_port.3.vid=0x2A03
hudleonardo.upload_port.3.pid=0x8036
hudleonardo.upload_port.4.board=leonardo

hudleonardo.upload.tool=avrdude
hudleonardo.upload.tool.default=avrdude
hudleonardo.upload.tool.network=arduino_ota
hudleonardo.upload.protocol=avr109
hudleonardo.upload.maximum_size=28672
hudleonardo.upload.maximum_data_size=2560
hudleonardo.upload.speed=57600
hudleonardo.upload.disable_flushing=true
hudleonardo.upload.use_1200bps_touch=true
hudleonardo.upload.wait_for_upload_port=true

hudleonardo.bootloader.tool=avrdude
hudleonardo.bootloader.tool.default=avrdude
hudleonardo.bootloader.low_fuses=0xff
hudleonardo.bootloader.high_fuses=0xd8
hudleonardo.bootloader.extended_fuses=0xcb
hudleonardo.bootloader.file=caterina/Caterina-Leonardo.hex
hudleonardo.bootloader.unlock_bits=0x3F
hudleonardo.bootloader.lock_bits=0x2F

hudleonardo.build.mcu=atmega32u4
hudleonardo.build.f_cpu=16000000L
hudleonardo.build.vid=0x2341
hudleonardo.build.pid=0x8063
hudleonardo.build.usb_product="HUD Controls"
hudleonardo.build.board=AVR_LEONARDO
hudleonardo.build.core=arduino
hudleonardo.build.variant=leonardo
hudleonardo.build.extra_flags={build.usb_flags}

##############################################################

ifeileonardo.name=IFEI
ifeileonardo.vid.0=0x2341
ifeileonardo.pid.0=0x0036
ifeileonardo.vid.1=0x2341
ifeileonardo.pid.1=0x8036
ifeileonardo.vid.2=0x2A03
ifeileonardo.pid.2=0x0036
ifeileonardo.vid.3=0x2A03
ifeileonardo.pid.3=0x8036
ifeileonardo.upload_port.0.vid=0x2341
ifeileonardo.upload_port.0.pid=0x0036
ifeileonardo.upload_port.1.vid=0x2341
ifeileonardo.upload_port.1.pid=0x8036
ifeileonardo.upload_port.2.vid=0x2A03
ifeileonardo.upload_port.2.pid=0x0036
ifeileonardo.upload_port.3.vid=0x2A03
ifeileonardo.upload_port.3.pid=0x8036
ifeileonardo.upload_port.4.board=leonardo

ifeileonardo.upload.tool=avrdude
ifeileonardo.upload.tool.default=avrdude
ifeileonardo.upload.tool.network=arduino_ota
ifeileonardo.upload.protocol=avr109
ifeileonardo.upload.maximum_size=28672
ifeileonardo.upload.maximum_data_size=2560
ifeileonardo.upload.speed=57600
ifeileonardo.upload.disable_flushing=true
ifeileonardo.upload.use_1200bps_touch=true
ifeileonardo.upload.wait_for_upload_port=true

ifeileonardo.bootloader.tool=avrdude
ifeileonardo.bootloader.tool.default=avrdude
ifeileonardo.bootloader.low_fuses=0xff
ifeileonardo.bootloader.high_fuses=0xd8
ifeileonardo.bootloader.extended_fuses=0xcb
ifeileonardo.bootloader.file=caterina/Caterina-Leonardo.hex
ifeileonardo.bootloader.unlock_bits=0x3F
ifeileonardo.bootloader.lock_bits=0x2F

ifeileonardo.build.mcu=atmega32u4
ifeileonardo.build.f_cpu=16000000L
ifeileonardo.build.vid=0x2341
ifeileonardo.build.pid=0x8062
ifeileonardo.build.usb_product="IFEI"
ifeileonardo.build.board=AVR_LEONARDO
ifeileonardo.build.core=arduino
ifeileonardo.build.variant=leonardo
ifeileonardo.build.extra_flags={build.usb_flags}

##############################################################

spinleonardo.name=SPIN
spinleonardo.vid.0=0x2341
spinleonardo.pid.0=0x0036
spinleonardo.vid.1=0x2341
spinleonardo.pid.1=0x8036
spinleonardo.vid.2=0x2A03
spinleonardo.pid.2=0x0036
spinleonardo.vid.3=0x2A03
spinleonardo.pid.3=0x8036
spinleonardo.upload_port.0.vid=0x2341
spinleonardo.upload_port.0.pid=0x0036
spinleonardo.upload_port.1.vid=0x2341
spinleonardo.upload_port.1.pid=0x8036
spinleonardo.upload_port.2.vid=0x2A03
spinleonardo.upload_port.2.pid=0x0036
spinleonardo.upload_port.3.vid=0x2A03
spinleonardo.upload_port.3.pid=0x8036
spinleonardo.upload_port.4.board=leonardo

spinleonardo.upload.tool=avrdude
spinleonardo.upload.tool.default=avrdude
spinleonardo.upload.tool.network=arduino_ota
spinleonardo.upload.protocol=avr109
spinleonardo.upload.maximum_size=28672
spinleonardo.upload.maximum_data_size=2560
spinleonardo.upload.speed=57600
spinleonardo.upload.disable_flushing=true
spinleonardo.upload.use_1200bps_touch=true
spinleonardo.upload.wait_for_upload_port=true

spinleonardo.bootloader.tool=avrdude
spinleonardo.bootloader.tool.default=avrdude
spinleonardo.bootloader.low_fuses=0xff
spinleonardo.bootloader.high_fuses=0xd8
spinleonardo.bootloader.extended_fuses=0xcb
spinleonardo.bootloader.file=caterina/Caterina-Leonardo.hex
spinleonardo.bootloader.unlock_bits=0x3F
spinleonardo.bootloader.lock_bits=0x2F

spinleonardo.build.mcu=atmega32u4
spinleonardo.build.f_cpu=16000000L
spinleonardo.build.vid=0x2341
spinleonardo.build.pid=0x8064
spinleonardo.build.usb_product="Spin Panel"
spinleonardo.build.board=AVR_LEONARDO
spinleonardo.build.core=arduino
spinleonardo.build.variant=leonardo
spinleonardo.build.extra_flags={build.usb_flags}

