madmoney99/OH-Sketches/boards.txt
##############################################################

canopyleonardo.name=Canopy
canopyleonardo.vid.0=0x2341
canopyleonardo.pid.0=0x0036
canopyleonardo.vid.1=0x2341
canopyleonardo.pid.1=0x8036
canopyleonardo.vid.2=0x2A03
canopyleonardo.pid.2=0x0036
canopyleonardo.vid.3=0x2A03
canopyleonardo.pid.3=0x8036
canopyleonardo.upload_port.0.vid=0x2341
canopyleonardo.upload_port.0.pid=0x0036
canopyleonardo.upload_port.1.vid=0x2341
canopyleonardo.upload_port.1.pid=0x8036
canopyleonardo.upload_port.2.vid=0x2A03
canopyleonardo.upload_port.2.pid=0x0036
canopyleonardo.upload_port.3.vid=0x2A03
canopyleonardo.upload_port.3.pid=0x8036
canopyleonardo.upload_port.4.board=leonardo

canopyleonardo.upload.tool=avrdude
canopyleonardo.upload.tool.default=avrdude
canopyleonardo.upload.tool.network=arduino_ota
canopyleonardo.upload.protocol=avr109
canopyleonardo.upload.maximum_size=28672
canopyleonardo.upload.maximum_data_size=2560
canopyleonardo.upload.speed=57600
canopyleonardo.upload.disable_flushing=true
canopyleonardo.upload.use_1200bps_touch=true
canopyleonardo.upload.wait_for_upload_port=true

canopyleonardo.bootloader.tool=avrdude
canopyleonardo.bootloader.tool.default=avrdude
canopyleonardo.bootloader.low_fuses=0xff
canopyleonardo.bootloader.high_fuses=0xd8
canopyleonardo.bootloader.extended_fuses=0xcb
canopyleonardo.bootloader.file=caterina/Caterina-Leonardo.hex
canopyleonardo.bootloader.unlock_bits=0x3F
canopyleonardo.bootloader.lock_bits=0x2F

canopyleonardo.build.mcu=atmega32u4
canopyleonardo.build.f_cpu=16000000L
canopyleonardo.build.vid=0x2341
canopyleonardo.build.pid=0x8065
canopyleonardo.build.usb_product="Canopy Panel"
canopyleonardo.build.board=AVR_LEONARDO
canopyleonardo.build.core=arduino
canopyleonardo.build.variant=leonardo
canopyleonardo.build.extra_flags={build.usb_flags}

##############################################################
BB1.name=BB1
BB1.vid.0=0x2341
BB1.pid.0=0x0036
BB1.vid.1=0x2341
BB1.pid.1=0x8036
BB1.vid.2=0x2A03
BB1.pid.2=0x0036
BB1.vid.3=0x2A03
BB1.pid.3=0x8036
BB1.upload_port.0.vid=0x2341
BB1.upload_port.0.pid=0x0036
BB1.upload_port.1.vid=0x2341
BB1.upload_port.1.pid=0x8036
BB1.upload_port.2.vid=0x2A03
BB1.upload_port.2.pid=0x0036
BB1.upload_port.3.vid=0x2A03
BB1.upload_port.3.pid=0x8036
BB1.upload_port.4.board=leonardo

BB1.upload.tool=avrdude
BB1.upload.tool.default=avrdude
BB1.upload.tool.network=arduino_ota
BB1.upload.protocol=avr109
BB1.upload.maximum_size=28672
BB1.upload.maximum_data_size=2560
BB1.upload.speed=57600
BB1.upload.disable_flushing=true
BB1.upload.use_1200bps_touch=true
BB1.upload.wait_for_upload_port=true

BB1.bootloader.tool=avrdude
BB1.bootloader.tool.default=avrdude
BB1.bootloader.low_fuses=0xff
BB1.bootloader.high_fuses=0xd8
BB1.bootloader.extended_fuses=0xcb
BB1.bootloader.file=caterina/Caterina-Leonardo.hex
BB1.bootloader.unlock_bits=0x3F
BB1.bootloader.lock_bits=0x2F

BB1.build.mcu=atmega32u4
BB1.build.f_cpu=16000000L
BB1.build.vid=0x2341
BB1.build.pid=0x8066
BB1.build.usb_product="ButtonBox1"
BB1.build.board=AVR_LEONARDO
BB1.build.core=arduino
BB1.build.variant=leonardo
BB1.build.extra_flags={build.usb_flags}

##############################################################

RCB.name=RCB
RCB.vid.0=0x2341
RCB.pid.0=0x0036
RCB.vid.1=0x2341
RCB.pid.1=0x8036
RCB.vid.2=0x2A03
RCB.pid.2=0x0036
RCB.vid.3=0x2A03
RCB.pid.3=0x8036
RCB.upload_port.0.vid=0x2341
RCB.upload_port.0.pid=0x0036
RCB.upload_port.1.vid=0x2341
RCB.upload_port.1.pid=0x8036
RCB.upload_port.2.vid=0x2A03
RCB.upload_port.2.pid=0x0036
RCB.upload_port.3.vid=0x2A03
RCB.upload_port.3.pid=0x8036
RCB.upload_port.4.board=leonardo

RCB.upload.tool=avrdude
RCB.upload.tool.default=avrdude
RCB.upload.tool.network=arduino_ota
RCB.upload.protocol=avr109
RCB.upload.maximum_size=28672
RCB.upload.maximum_data_size=2560
RCB.upload.speed=57600
RCB.upload.disable_flushing=true
RCB.upload.use_1200bps_touch=true
RCB.upload.wait_for_upload_port=true

RCB.bootloader.tool=avrdude
RCB.bootloader.tool.default=avrdude
RCB.bootloader.low_fuses=0xff
RCB.bootloader.high_fuses=0xd8
RCB.bootloader.extended_fuses=0xcb
RCB.bootloader.file=caterina/Caterina-Leonardo.hex
RCB.bootloader.unlock_bits=0x3F
RCB.bootloader.lock_bits=0x2F

RCB.build.mcu=atmega32u4
RCB.build.f_cpu=16000000L
RCB.build.vid=0x2341
RCB.build.pid=0x8067
RCB.build.usb_product="RH CB Box"
RCB.build.board=AVR_LEONARDO
RCB.build.core=arduino
RCB.build.variant=leonardo
RCB.build.extra_flags={build.usb_flags}

##############################################################

LCB.name=LCB
LCB.vid.0=0x2341
LCB.pid.0=0x0036
LCB.vid.1=0x2341
LCB.pid.1=0x8036
LCB.vid.2=0x2A03
LCB.pid.2=0x0036
LCB.vid.3=0x2A03
LCB.pid.3=0x8036
LCB.upload_port.0.vid=0x2341
LCB.upload_port.0.pid=0x0036
LCB.upload_port.1.vid=0x2341
LCB.upload_port.1.pid=0x8036
LCB.upload_port.2.vid=0x2A03
LCB.upload_port.2.pid=0x0036
LCB.upload_port.3.vid=0x2A03
LCB.upload_port.3.pid=0x8036
LCB.upload_port.4.board=leonardo

LCB.upload.tool=avrdude
LCB.upload.tool.default=avrdude
LCB.upload.tool.network=arduino_ota
LCB.upload.protocol=avr109
LCB.upload.maximum_size=28672
LCB.upload.maximum_data_size=2560
LCB.upload.speed=57600
LCB.upload.disable_flushing=true
LCB.upload.use_1200bps_touch=true
LCB.upload.wait_for_upload_port=true

LCB.bootloader.tool=avrdude
LCB.bootloader.tool.default=avrdude
LCB.bootloader.low_fuses=0xff
LCB.bootloader.high_fuses=0xd8
LCB.bootloader.extended_fuses=0xcb
LCB.bootloader.file=caterina/Caterina-Leonardo.hex
LCB.bootloader.unlock_bits=0x3F
LCB.bootloader.lock_bits=0x2F

LCB.build.mcu=atmega32u4
LCB.build.f_cpu=16000000L
LCB.build.vid=0x2341
LCB.build.pid=0x8068
LCB.build.usb_product="LH CB Box"
LCB.build.board=AVR_LEONARDO
LCB.build.core=arduino
LCB.build.variant=leonardo
LCB.build.extra_flags={build.usb_flags}

##############################################################

LHAUX.name=LHAUX
LHAUX.vid.0=0x2341
LHAUX.pid.0=0x0036
LHAUX.vid.1=0x2341
LHAUX.pid.1=0x8036
LHAUX.vid.2=0x2A03
LHAUX.pid.2=0x0036
LHAUX.vid.3=0x2A03
LHAUX.pid.3=0x8036
LHAUX.upload_port.0.vid=0x2341
LHAUX.upload_port.0.pid=0x0036
LHAUX.upload_port.1.vid=0x2341
LHAUX.upload_port.1.pid=0x8036
LHAUX.upload_port.2.vid=0x2A03
LHAUX.upload_port.2.pid=0x0036
LHAUX.upload_port.3.vid=0x2A03
LHAUX.upload_port.3.pid=0x8036
LHAUX.upload_port.4.board=leonardo

LHAUX.upload.tool=avrdude
LHAUX.upload.tool.default=avrdude
LHAUX.upload.tool.network=arduino_ota
LHAUX.upload.protocol=avr109
LHAUX.upload.maximum_size=28672
LHAUX.upload.maximum_data_size=2560
LHAUX.upload.speed=57600
LHAUX.upload.disable_flushing=true
LHAUX.upload.use_1200bps_touch=true
LHAUX.upload.wait_for_upload_port=true

LHAUX.bootloader.tool=avrdude
LHAUX.bootloader.tool.default=avrdude
LHAUX.bootloader.low_fuses=0xff
LHAUX.bootloader.high_fuses=0xd8
LHAUX.bootloader.extended_fuses=0xcb
LHAUX.bootloader.file=caterina/Caterina-Leonardo.hex
LHAUX.bootloader.unlock_bits=0x3F
LHAUX.bootloader.lock_bits=0x2F

